jlpoltrack/stm32ll-lib/src/stdstm32-uarte.h
  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART6 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32C5
    #error UART6 NOT AVAILABLE !
  #endif

#elif defined UARTE_USE_UART7 || defined UARTE_USE_UART7_PE8PE7 || defined UARTE_USE_UART7_PF7PF6
  #define UARTE_UARTx             UART7
  #ifdef UARTE_USE_UART7
    // user needs to specify UARTE_USE_TX_IO, UARTE_USE_RX_IO, and possibly UARTE_USE_IO_AF
  #elif defined UARTE_USE_UART7_PE8PE7
    #define UARTE_TX_IO           IO_PE8
    #define UARTE_RX_IO           IO_PE7
  #elif defined UARTE_USE_UART7_PF7PF6 // was UART7_REMAPPED
    #define UARTE_TX_IO           IO_PF7
    #define UARTE_RX_IO           IO_PF6
  #endif
  #define UARTE_IO_AF             IO_AF_8
  #define UARTE_IRQn              UART7_IRQn
  #define UARTE_IRQHandler        UART7_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART7 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32C5
    #error UART7 NOT AVAILABLE !
  #endif

#elif defined UARTE_USE_UART8 || defined UARTE_USE_UART8_PE1PE0
  #define UARTE_UARTx             UART8
  #ifdef UARTE_USE_UART8
    // user needs to specify UARTE_USE_TX_IO, UARTE_USE_RX_IO, and possibly UARTE_USE_IO_AF
  #elif defined UARTE_USE_UART8_PE1PE0
    #define UARTE_TX_IO           IO_PE1
    #define UARTE_RX_IO           IO_PE0
  #endif
  #define UARTE_IO_AF             IO_AF_8
  #define UARTE_IRQn              UART8_IRQn
  #define UARTE_IRQHandler        UART8_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART8 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32C5
    #error UART8 NOT AVAILABLE !
  #endif

#elif defined UARTE_USE_LPUART1 || defined UARTE_USE_LPUART1_PA2PA3 || defined UARTE_USE_LPUART1_PC1PC0 || \
      defined UARTE_USE_LPUART1_PA9PA10 || defined UARTE_USE_LPUART1_PB6PB7
  #define UARTE_UARTx             LPUART1
  #ifdef UARTE_USE_LPUART1
    // user needs to specify UARTE_USE_TX_IO, UARTE_USE_RX_IO, and possibly UARTE_USE_IO_AF
  #elif defined UARTE_USE_LPUART1_PA2PA3
    #define UARTE_TX_IO           IO_PA2
    #define UARTE_RX_IO           IO_PA3
    #ifdef STM32G4
      #define UARTE_IO_AF         IO_AF_12 // G4
    #elif defined STM32C5
      // C5 silicon swap: AF table has PA2=LPUART1_RX, PA3=LPUART1_TX (opposite of G4/WL).
      // override the TX/RX IO assignments above for C5.
      #undef UARTE_TX_IO
      #undef UARTE_RX_IO
      #define UARTE_TX_IO         IO_PA3
      #define UARTE_RX_IO         IO_PA2
      #define UARTE_IO_AF         IO_AF_3
    #else
      #define UARTE_IO_AF         IO_AF_8 // WL
    #endif
  #elif defined UARTE_USE_LPUART1_PC1PC0 // was LPUART1_REMAPPED
    #define UARTE_TX_IO           IO_PC1
    #define UARTE_RX_IO           IO_PC0
    #define UARTE_IO_AF           IO_AF_8
  #elif defined UARTE_USE_LPUART1_PA9PA10 // only C5, not swapped
    #define UARTE_TX_IO           IO_PA9
    #define UARTE_RX_IO           IO_PA10
    #define UARTE_IO_AF           IO_AF_3
  #elif defined UARTE_USE_LPUART1_PB6PB7 // only C5, not swapped
    #define UARTE_TX_IO           IO_PB6
    #define UARTE_RX_IO           IO_PB7
    #define UARTE_IO_AF           IO_AF_8
  #endif
  #define UARTE_IRQn              LPUART1_IRQn
  #define UARTE_IRQHandler        LPUART1_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32F7
    #error LPUART1 NOT AVAILABLE !
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
  #elif defined STM32C5
    // C5 has LPUART1 on PA2/PA3 (AF3, RX/TX swapped, handled above), PA9/PA10 (AF3) and
    // PB6/PB7 (AF8). PC0/PC1 are bonded up to LQFP64, but carry SPI2, not LPUART1.
    #if defined UARTE_USE_LPUART1_PC1PC0
      #error UARTE_USE_LPUART1_PC1PC0 not available on STM32C5, PC0/PC1 are not LPUART1 pins ! use UARTE_USE_LPUART1_PA9PA10 or UARTE_USE_LPUART1_PB6PB7
    #endif
  #endif

#else
  #error No UARTE_USE_UARTx defined!
#endif


// LPUART1 uses the LL_LPUART_xxx API instead of LL_USART_xxx, so several blocks below
// have to know which one was selected. define it once here rather than repeating the
// list of LPUART1 mappings at every use.
#if defined UARTE_USE_LPUART1 || defined UARTE_USE_LPUART1_PA2PA3 || defined UARTE_USE_LPUART1_PC1PC0 || \
    defined UARTE_USE_LPUART1_PA9PA10 || defined UARTE_USE_LPUART1_PB6PB7
  #define UARTE_IS_LPUART
#endif


// allows us to overwrite the default pin assignment
#ifdef UARTE_USE_TX_IO
  #undef UARTE_TX_IO
  #define UARTE_TX_IO             UARTE_USE_TX_IO
#endif
#ifdef UARTE_USE_RX_IO
  #undef UARTE_RX_IO
  #define UARTE_RX_IO             UARTE_USE_RX_IO
#endif
#ifdef UARTE_USE_IO_AF
  #undef UARTE_IO_AF
  #define UARTE_IO_AF             UARTE_USE_IO_AF
#endif


// catch missing defines, compiler will throw error anyhow, but so it is nicer
#if defined UARTE_USE_TX && !defined UARTE_TX_IO
  #error No UARTE TX IO defined!
#endif
#if defined UARTE_USE_RX && !defined UARTE_RX_IO
  #error No UARTE RX IO defined!
#endif
#if !defined UARTE_IO_AF
  #error No UARTE IO AF defined!
#endif


//-------------------------------------------------------
// COMMENT:
// LL_USART_XX and LL_LPUART_XX flags are just redefines of USART_XX flags.
// So, we can use USART_XX here and below.
// This has also the advantage that it works for both USART and LPUART.
//
// Note: LPUART does not appear to have STOPBITS_0_5 and STOPBITS_1_5!!
//
// The LL_USART_xx() and LL_LPUART_xx() functions which only relate to flags or
// registers can be used for both USART and LPUART.
// Below we simply use the LL_USART_xx() functions for both.
// Notably, this appears to be incorrect for the init struct functions, which hence
// need special treatment.

#if defined UARTE_IS_LPUART
#if !(LL_USART_PARITY_NONE == LL_LPUART_PARITY_NONE) || !(LL_USART_PARITY_EVEN == LL_LPUART_PARITY_EVEN) || \
    !(LL_USART_PARITY_ODD == LL_LPUART_PARITY_ODD) || \
    !(LL_USART_STOPBITS_1 == LL_LPUART_STOPBITS_1) || !(LL_USART_STOPBITS_2 == LL_LPUART_STOPBITS_2)
  //#error Missmatch of LL_USART and L_LPUART flags!
#endif
#endif


//-------------------------------------------------------
// Glue macros
//-------------------------------------------------------

#if defined STM32F1
  #define REG_DR        DR
  #define REG_SR        SR
  #define FLAG_SR_RXNE  LL_USART_SR_RXNE
  #define FLAG_SR_ORE   LL_USART_SR_ORE
  #define FLAG_SR_NE    LL_USART_SR_NE
  #define FLAG_SR_FE    LL_USART_SR_FE
  #define FLAG_SR_TXE   LL_USART_SR_TXE
  #define FLAG_SR_TC    LL_USART_SR_TC
  #define FLAG_SR_IDLE  LL_USART_SR_IDLE
#elif defined STM32F3 || defined STM32F7 || defined STM32L4 || defined STM32F0
  #define REG_DR        TDR
  #define REG_SR        ISR
  #define FLAG_SR_RXNE  LL_USART_ISR_RXNE
  #define FLAG_SR_ORE   LL_USART_ISR_ORE
  #define FLAG_SR_NE    LL_USART_ISR_NE
  #define FLAG_SR_FE    LL_USART_ISR_FE
  #define FLAG_SR_TXE   LL_USART_ISR_TXE
  #define FLAG_SR_TC    LL_USART_ISR_TC
  #define FLAG_SR_IDLE  LL_USART_ISR_IDLE
#elif defined STM32G4 || defined STM32WL || defined STM32C5
  #define REG_DR        TDR
  #define REG_SR        ISR
  #define FLAG_SR_RXNE  LL_USART_ISR_RXNE_RXFNE
  #define FLAG_SR_ORE   LL_USART_ISR_ORE
  #define FLAG_SR_NE    LL_USART_ISR_NE
  #define FLAG_SR_FE    LL_USART_ISR_FE
  #define FLAG_SR_TXE   LL_USART_ISR_TXE_TXFNF
  #define FLAG_SR_TC    LL_USART_ISR_TC
  #define FLAG_SR_IDLE  LL_USART_ISR_IDLE
#endif

#if defined STM32F3 || defined STM32F7 || defined STM32F0
  #define FLAGS_ICR     (LL_USART_ICR_IDLECF | LL_USART_ICR_ORECF | LL_USART_ICR_NCF | LL_USART_ICR_FECF | LL_USART_ICR_PECF)
#elif defined STM32G4 || defined STM32L4 || defined STM32WL || defined STM32C5
  #define FLAGS_ICR     (LL_USART_ICR_IDLECF | LL_USART_ICR_ORECF | LL_USART_ICR_NECF | LL_USART_ICR_FECF | LL_USART_ICR_PECF)
#endif


//-------------------------------------------------------
// ISR routine
//-------------------------------------------------------
#if defined UARTE_USE_RX || defined UARTE_USE_TX_ISR

void UARTE_IRQHandler(void)
{
  // Cube HAL for f103rc is also calling this first independent on irqs
  uint16_t usart_sr = LL_USART_ReadReg(UARTE_UARTx, REG_SR); // read USART_SR register

#ifdef UARTE_USE_RX
  if ((usart_sr & FLAG_SR_RXNE) && LL_USART_IsEnabledIT_RXNE(UARTE_UARTx)) {
#ifdef UARTE_USE_RXERRORCOUNT
    if (usart_sr & FLAG_SR_ORE) uarte_errorcnt_rxoverrun++;
    if (usart_sr & FLAG_SR_NE) uarte_errorcnt_rxnoise++;
    if (usart_sr & FLAG_SR_FE) uarte_errorcnt_rxframe++;
#endif
    // Cube LL driver (for f103?) says that reading SR and then writing to DR will clear error flags, so do it after error checks
    uint8_t usart_dr = LL_USART_ReceiveData8(UARTE_UARTx); // read USART_DR register, clears RXNE and RX error flags
#ifdef UARTE_RX_CALLBACK_FULL
    UARTE_RX_CALLBACK_FULL(usart_dr);
#else
    uint16_t next = (uarte_rxwritepos + 1) & UARTE_RXBUFSIZEMASK;
    if (uarte_rxreadpos != next) { // fifo not full
      uarte_rxbuf[next] = usart_dr;
      uarte_rxwritepos = next;
    }
#endif
  }
#if defined STM32F1
  // ORE is enabled along with RXNE, so we need to handle it
  // ORE bit is reset by read to USART_SR followed by read to USART_DR
  if (usart_sr & FLAG_SR_ORE) {
    LL_USART_ReceiveData8(UARTE_UARTx); // read USART_DR register, clears RXNE and RX error flags
  }
#else
  // F3: ORE is enabled along with RXNE, but can be cleared by writing 1 to ICR
  // F7: these are cleared by write 1 to the ICR register, not by a read of DR register!
  LL_USART_WriteReg(UARTE_UARTx, ICR, FLAGS_ICR);
#endif
#endif

#ifdef UARTE_USE_TX_ISR
  if ((usart_sr & FLAG_SR_TXE) && LL_USART_IsEnabledIT_TXE(UARTE_UARTx)) {
    if (uarte_txwritepos != uarte_txreadpos) { // fifo not empty
      uarte_txreadpos = (uarte_txreadpos + 1) & UARTE_TXBUFSIZEMASK;
      LL_USART_TransmitData8(UARTE_UARTx, uarte_txbuf[uarte_txreadpos]); // write to USART_DR register, clears TXE flag, as well as TC
    } else {
      LL_USART_DisableIT_TXE(UARTE_UARTx); // disable interrupt when empty
#ifdef UARTE_TC_CALLBACK
      // ATTENTION: doesn't distinguish between empty fifo and last byte just send!
      LL_USART_ClearFlag_TC(UARTE_UARTx); // enable TC interrupt
      LL_USART_EnableIT_TC(UARTE_UARTx);
#endif
#ifdef UARTE_IDLE_CALLBACK
      LL_USART_ClearFlag_IDLE(UARTE_UARTx); // enable IDLE interrupt
      LL_USART_EnableIT_IDLE(UARTE_UARTx);
#endif
    }
  }

