jlpoltrack/stm32ll-lib/src/stdstm32-uarte.h
  // Configure pin USART/LPUART Tx as alternative function push-pull
#ifdef UARTE_USE_TX
  gpio_init_af(UARTE_TX_IO, IO_MODE_OUTPUT_ALTERNATE_PP, UARTE_IO_AF, IO_SPEED_VERYFAST);
#endif

  // Configure pin USART/LPUART Rx as input with pull up
#ifdef UARTE_USE_RX
#ifndef UARTE_INVERTED
  gpio_init_af(UARTE_RX_IO, IO_MODE_INPUT_PU, UARTE_IO_AF, IO_SPEED_VERYFAST);
#else
  gpio_init_af(UARTE_RX_IO, IO_MODE_INPUT_PD, UARTE_IO_AF, IO_SPEED_VERYFAST);
#endif
#endif

  // Configure USART/LPUART
  _uarte_initprotocol(UARTE_BAUD, XUART_PARITY_NO, UART_STOPBIT_1);
#if !(defined UARTE_IS_LPUART)
  LL_USART_ConfigAsyncMode(UARTE_UARTx);
#if defined STM32G4
  LL_USART_DisableFIFO(UARTE_UARTx);
  LL_USART_SetTXFIFOThreshold(UARTE_UARTx, LL_USART_FIFOTHRESHOLD_1_8);
  LL_USART_SetRXFIFOThreshold(UARTE_UARTx, LL_USART_FIFOTHRESHOLD_1_8);
#elif defined STM32C5
  LL_USART_DisableFIFO(UARTE_UARTx);
  LL_USART_SetTXFIFOThreshold(UARTE_UARTx, LL_USART_FIFO_THRESHOLD_1_8);
  LL_USART_SetRXFIFOThreshold(UARTE_UARTx, LL_USART_FIFO_THRESHOLD_1_8);
#endif
#else
  LL_LPUART_DisableFIFO(UARTE_UARTx);
  LL_LPUART_SetTXFIFOThreshold(UARTE_UARTx, LL_LPUART_FIFOTHRESHOLD_1_8);
  LL_LPUART_SetRXFIFOThreshold(UARTE_UARTx, LL_LPUART_FIFOTHRESHOLD_1_8);
#endif

#ifdef UARTE_INVERTED
#ifdef UARTE_USE_TX
  LL_USART_SetTXPinLevel(UARTE_UARTx, LL_USART_TXPIN_LEVEL_INVERTED);
#endif
#ifdef UARTE_USE_RX
  LL_USART_SetRXPinLevel(UARTE_UARTx, LL_USART_RXPIN_LEVEL_INVERTED);
#endif
#endif

  // Configure NVIC channel
#if defined UARTE_USE_RX || defined UARTE_USE_TX_ISR
#ifdef UARTE_PREEMPTIONPRIORITY
  #error Legacy UARTE_PREEMPTIONPRIORITY used !
#endif
#ifdef UARTE_SUBPRIORITY
  #error Legacy UARTE_SUBPRIORITY used !
#endif
#ifdef UARTE_PRIORITY
#error Legacy UARTE_PRIORITY used !
#endif
#ifndef UARTE_IRQ_PRIORITY
  #define UARTE_IRQ_PRIORITY  15 // set priority to lowest
#endif
  nvic_irq_enable_w_priority(UARTE_IRQn, UARTE_IRQ_PRIORITY);
#endif

#ifdef UARTE_USE_TX_ISR
  // Disable Transmit Data Register empty interrupt
  LL_USART_DisableIT_TXE(UARTE_UARTx);
  LL_USART_DisableIT_TC(UARTE_UARTx);
  LL_USART_ClearFlag_TC(UARTE_UARTx);
  // Flush buffer
  uarte_txwritepos = uarte_txreadpos = 0;
#endif

#ifdef UARTE_USE_RX
  // Disable Receive Data register not empty interrupt
  LL_USART_DisableIT_RXNE(UARTE_UARTx);
#ifdef STM32F1
  LL_USART_ClearFlag_RXNE(UARTE_UARTx);
#endif
  // Flush buffer
  uarte_rxwritepos = uarte_rxreadpos = 0;
#ifdef UARTE_USE_RXERRORCOUNT
  uarte_errorcnt_rxnoise = 0;
  uarte_errorcnt_rxframe = 0;
  uarte_errorcnt_rxoverrun = 0;
#endif
#endif

  // Cube HAL for f103rc
  /* In asynchronous mode, the following bits must be kept cleared:
     - LINEN and CLKEN bits in the USART_CR2 register,
     - SCEN, HDSEL and IREN  bits in the USART_CR3 register.*/
  CLEAR_BIT(UARTE_UARTx->CR2, USART_CR2_CLKEN);
  CLEAR_BIT(UARTE_UARTx->CR3, USART_CR3_HDSEL);
#if defined USART_CR2_LINEN
  CLEAR_BIT(UARTE_UARTx->CR2, USART_CR2_LINEN);
#endif
#if defined USART_CR3_SCEN || defined USART_CR3_IREN // assume that always both are defined
  CLEAR_BIT(UARTE_UARTx->CR3, (USART_CR3_SCEN | USART_CR3_IREN));
#endif

#if defined STM32F7
  // reading the F722 manual I've added this
  CLEAR_BIT(UARTE_UARTx->CR1, (USART_CR1_EOBIE | USART_CR1_RTOIE | USART_CR1_CMIE | USART_CR1_PEIE | USART_CR1_IDLEIE));
  CLEAR_BIT(UARTE_UARTx->CR2, (USART_CR2_RTOEN | USART_CR2_CPOL | USART_CR2_CPHA | USART_CR2_LBCL | USART_CR2_LBDIE | USART_CR2_LBDL));
  CLEAR_BIT(UARTE_UARTx->CR3, (USART_CR3_TCBGTIE | USART_CR3_CTSIE | USART_CR3_EIE));
#if !defined UARTE_USE_RXERRORCOUNT
  // Disable ORE in the first place
  LL_USART_DisableOverrunDetect(UARTE_UARTx); // disables ORE, check how F1 is behaving
#endif
#endif

#if defined STM32G4 || defined STM32F3 || defined STM32WL || defined STM32F0 || defined STM32C5
#if !defined UARTE_USE_RXERRORCOUNT
  LL_USART_DisableOverrunDetect(UARTE_UARTx);
#endif
#endif

  // Enable USART/LPUART
  LL_USART_Enable(UARTE_UARTx);

#if defined STM32G4 ||defined STM32F3 || defined STM32WL || defined STM32F0 || defined STM32C5
  // Polling UART/LPUART initialisation
  while((!(LL_USART_IsActiveFlag_TEACK(UARTE_UARTx))) || (!(LL_USART_IsActiveFlag_REACK(UARTE_UARTx)))) {};
#endif
}


void uarte_init(void)
{
  uarte_init_isroff();
  uarte_rx_enableisr(ENABLE);
}


//-------------------------------------------------------
// System bootloader
//-------------------------------------------------------
// AN2606 Application note: STM32 microcontroller system memory boot mode

#if defined STM32F1
  // STM32F10xx
  #if defined UARTE_USE_UART1_PA9PA10
    #define UARTE_HAS_SYSTEMBOOT
  #endif
  // STM32F105xx/107x
  // STM32F10xxx XL-densit
  // TODO

#elif defined STM32F3
  // STM32F302xB(C)/303xB(C)
  #if defined UARTE_USE_UART1_PA9PA10 || defined UARTE_USE_UART2_PD5PD6
    #define UARTE_HAS_SYSTEMBOOT
  #endif
  // STM32F301xx/302x4(6/8)
  // STM32F302xD(E)/303xD(E)
  // STM32F303x4(6/8)/334xx/328xx
  //#if defined UARTE_USE_UART1_PA9PA10 || defined UARTE_USE_UART2_PA2PA3
  //  #define UARTE_HAS_SYSTEMBOOT
  //#endif

#elif defined STM32F7

  #error TODO

#elif defined STM32G4
  // STM32G431xx/441x
  // STM32G47xxx/48xx
  // STM32G491xx/4A1x
  #if defined UARTE_USE_UART1_PA9PA10 || defined UARTE_USE_UART2_PA2PA3 || defined UARTE_USE_UART3_PC10PC11
    #define UARTE_HAS_SYSTEMBOOT
  #endif

#elif defined STM32L4
  // STM32L412xx/422x
  // STM32L43xxx/44xx
  // STM32L45xxx/46xxx
  // STM32L47xxx/48xx
  #if defined UARTE_USE_UART1_PA9PA10 || defined UARTE_USE_UART2_PA2PA3 || defined UARTE_USE_UART3_PC10PC11
    #define UARTE_HAS_SYSTEMBOOT
  #endif

#elif defined STM32WL
  // STM32WLE5xx/55x
  #if defined UARTE_USE_UART1_PA9PA10 || defined UARTE_USE_UART2_PA2PA3
    #define UARTE_HAS_SYSTEMBOOT
  #endif

#elif defined STM32F0
  // STM32F070x6
  // STM32F070xB
  // STM32F071xx/072x
  #if defined UARTE_USE_UART1_PA9PA10 || defined UARTE_USE_UART2_PA14PA15
    #define UARTE_HAS_SYSTEMBOOT
  #endif
  // STM32F09xxx
  // TODO

#elif defined STM32C5
  // supported scope is C562 and below: C531/532/542 (AN2606 Table 20) and C55xxx/562
  // (Table 23) both boot on USART1 PA9/PA10, USART2 PA2/PA3 and UART4 PA0/PA1.
  // C55xxx/562 additionally boot on USART3 PD8/PD9, not offered as a mapping here.
  #if defined UARTE_USE_UART1_PA9PA10 || defined UARTE_USE_UART2_PA2PA3 || defined UARTE_USE_UART4_PA0PA1
    #define UARTE_HAS_SYSTEMBOOT
  #endif


#endif


uint8_t uarte_has_systemboot(void)
{
#ifdef UARTE_HAS_SYSTEMBOOT
    return 1;
#else
    return 0;
#endif
}


//-------------------------------------------------------
#ifdef __cplusplus
}
#endif
#endif // STDSTM32_UARTE_H
